# =============================================================================
# modules/system/network.nix — Сеть
# =============================================================================
# NetworkManager (Wi-Fi через iwd подключается опционально через настройки).
# hostName берётся из имени папки hosts/<name>/ через специальный аргумент
# hostName (передаётся mkHost.nix).
# =============================================================================
{ hostName, ... }:
{
  networking.hostName              = hostName;
  networking.networkmanager.enable = true;
}
